[
  {
    "logo": "kotlin",
    "name": "Kotlin",
    "description": "<bold>Kotlin</bold> — это современный язык программирования общего назначения с поддержкой статической типизации, разработанный компанией JetBrains. Он совместим с Java и ориентирован на разработку приложений для платформы Java Virtual Machine (JVM), Android, а также для веба и нативных платформ.",
    "history": {
      "nameOrigin": "Kotlin назван в честь острова Котлин, расположенного рядом с Санкт-Петербургом, где находится один из офисов JetBrains. Это следовало традиции, согласно которой языки программирования называются в честь географических мест (например, Java).",
      "developmentStart": "Начало разработки Kotlin датируется 2010 годом. Основная цель JetBrains заключалась в создании языка, который был бы полностью совместим с Java, но избавлялся от недостатков Java, таких как многословность, сложность работы с `null`, и предлагал более современные средства разработки.",
      "firstRelease": "Первая стабильная версия языка Kotlin, версия 1.0, была выпущена в феврале 2016 года. Это ознаменовало готовность языка для использования в реальных проектах. Позже, в 2017 году, Google официально объявил Kotlin языком для разработки Android-приложений, что значительно ускорило его распространение."
    },
    "code": "<rkey>fun</rkey> <rfunc>main</rfunc>() {\n    <rfunc>println</rfunc>(<rstr>\"Hello, World!\"</rstr>)\n}",
    "developmentStartYear": "2011",
    "firstVersionYear": "2016",
    "creators": [
      "JetBrains"
    ],
    "designStyle": "Kotlin разработан с акцентом на лаконичность и читаемость кода. Он использует минималистичный синтаксис, благодаря чему разработчики могут писать меньше кода для достижения тех же целей. Например, с помощью лямбда-выражений, data-классов и расширений функций код становится более выразительным и коротким по сравнению с Java.",
    "fileExtensions": {
      ".kt": "Основное расширение файлов исходного кода Kotlin.",
      ".kts": "Используется для скриптов на Kotlin, которые могут выполняться как самостоятельные программы.",
      ".kexe": "Файлы исполняемых программ для платформы Kotlin/Native.",
      ".klib": "Библиотеки для Kotlin/Native."
    },
    "paradigms": {
      "paradigms": [
        13,
        14,
        6,
        9,
        2,
        5,
        7,
        17,
        15
      ]
    },
    "typing": "Статическая, Сильная",
    "useCases": [
      "Мобильная разработка",
      "Серверная разработка",
      "Веб-разработка",
      "Кроссплатформенная разработка"
    ],
    "compatibility": [
      "JVM",
      "Android",
      "JavaScript",
      "Native",
      "iOS",
      "macOS",
      "Windows",
      "Linux"
    ],
    "popularFrameworks": [
      "Ktor",
      "Compose Multiplatform UI",
      "Spring",
      "Exposed",
      "TornadoFX"
    ],
    "features": [
      "Безопасность null-значений",
      "Корутины",
      "Совместимость с Java",
      "Kotlin Multiplatform",
      "Лямбда-выражения",
      "Интероперабельность с Java-кодом"
    ],
    "prosAndCons": {
      "pros": [
        "Полная совместимость с Java",
        "Лаконичный и выразительный синтаксис",
        "Сильная поддержка сообщества",
        "Корутины для асинхронного программирования",
        "Kotlin Multiplatform для кроссплатформенной разработки"
      ],
      "cons": [
        "Медленная компиляция на крупных проектах",
        "Ограниченная совместимость с устаревшими Java-библиотеками",
        "Молодая экосистема по сравнению с Java"
      ]
    },
    "relatedLanguages": [
      "java",
      "scala",
      "groovy",
      "swift"
    ],
    "ideSupport": [
      "IntelliJ IDEA",
      "Android Studio",
      "Eclipse",
      "VSCode",
      "NetBeans"
    ],
    "platforms": [
      "Android",
      "iOS",
      "Windows",
      "macOS",
      "Linux"
    ],
    "tooling": {
      "buildTools": [
        "Gradle",
        "Maven"
      ],
      "testingFrameworks": [
        "JUnit",
        "Spek",
        "Kotest"
      ]
    },
    "community": {
      "Slack": "Kotlin Slack — официальное сообщество для обмена опытом и обсуждения проблем.",
      "StackOverflow": "StackOverflow — один из основных ресурсов для поиска ответов по проблемам с Kotlin.",
      "Reddit": "Reddit — дискуссионная платформа с активными обсуждениями Kotlin.",
      "KotlinConf": "KotlinConf — ежегодная конференция, посвященная Kotlin, организуемая JetBrains.",
      "Google I/O": "Google I/O — конференция, где часто анонсируются новинки Kotlin для Android-разработчиков."
    },
    "future": "JetBrains активно развивает Kotlin в направлении кроссплатформенной разработки. Ожидаются улучшения в производительности компилятора и расширение функциональности для кроссплатформенных решений, таких как Kotlin Multiplatform Mobile (KMM). Также усиливается поддержка нативных платформ, включая Windows и macOS."
  }
]